frontend/controllers/UserController.php

    public function actionCreate()
    {
        $model = new User();
        $modelUp = new UploadForm();

        if ($this->request->isPost) {
            if ($model->load($this->request->post())) {

                $modelUp->imageFile = UploadedFile::getInstance($model, 'avatar_url');
                // $path = Yii::getAlias('@frontend') .'/web/upload/';
                $fileName = $modelUp->upload();


                // $model->avatar_url = UploadedFile::getInstance($model, 'avatar_url');
                // xx($model->avatar_url);
                // $model->avatar_url->saveAs($model->avatar_url->tempName, $path); // lưu ảnh vào thư mục uploads
                $model->avatar_url = $fileName;
                $model->save();
---
INSERT INTO `user` (`name`, `number_phone`, `sex`, `email`, `avatar_url`, `password`, `date_create`, `date_update`, `last_login`) VALUES ('Hoa ssssaa', 123, 'nam', 'ádfasdasd', 'dfdsfsdf', '', NULL, NULL, NULL)

    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {
---
SELECT * FROM `user` WHERE `id`='3'